public class FullNameRandom {//создание ФИО случайного пола
  private final static String[] MALE_NAME_1 = {"Смирнов","Иванов","Кузнецов","Соколов","Попов","Лебедев","Козлов",
      "Новиков","Морозов","Петров","Волков","Соловьёв","Васильев","Зайцев","Павлов","Семёнов",
      "Голубев","Виноградов","Богданов","Воробьёв","Фёдоров","Михайлов","Беляев","Тарасов","Белов",
      "Комаров","Орлов","Киселёв","Макаров","Андреев","Ковалёв","Ильин","Гусев","Титов","Кузьмин",
      "Кудрявцев","Баранов","Куликов","Алексеев","Степанов","Яковлев","Сорокин","Сергеев","Романов",
      "Захаров","Борисов","Королёв","Герасимов","Пономарёв","Григорьев","Лазарев","Медведев","Ершов",
      "Никитин","Соболев","Рябов","Поляков","Цветков","Данилов","Жуков","Фролов","Журавлёв",
      "Николаев","Крылов","Максимов","Сидоров","Осипов","Белоусов","Федотов","Дорофеев","Егоров",
      "Матвеев","Бобров","Дмитриев","Калинин","Анисимов","Петухов","Антонов","Тимофеев","Никифоров",
      "Веселов","Филиппов","Марков","Большаков","Суханов","Миронов","Ширяев","Александров",
      "Коновалов","Шестаков","Казаков","Ефимов","Денисов","Громов","Фомин","Давыдов","Мельников",
      "Щербаков","Блинов","Колесников"};
  private final static String[] FEMALE_NAME_1 = {"Смирнова","Иванова","Кузнецова","Соколова","Попова","Лебедева","Козлова",
      "Новикова","Морозова","Петрова","Волкова","Соловьёва","Васильева","Зайцева","Павлова","Семёнова",
      "Голубева","Виноградова","Богданова","Воробьёва","Фёдорова","Михайлова","Беляева","Тарасова","Белова",
      "Комарова","Орлова","Киселёва","Макарова","Андреева","Ковалёва","Ильина","Гусева","Титова","Кузьмина",
      "Кудрявцева","Баранова","Куликова","Алексеева","Степанова","Яковлева","Сорокина","Сергеева","Романова",
      "Захарова","Борисова","Королёва","Герасимова","Пономарёва","Григорьева","Лазарева","Медведева","Ершова",
      "Никитина","Соболева","Рябова","Полякова","Цветкова","Данилова","Жукова","Фролова","Журавлёва",
      "Николаева","Крылова","Максимова","Сидорова","Осипова","Белоусова","Федотова","Дорофеева","Егорова",
      "Матвеева","Боброва","Дмитриева","Калинина","Анисимова","Петухова","Антонова","Тимофеева","Никифорова",
      "Веселова","Филиппова","Маркова","Большакова","Суханова","Миронова","Ширяева","Александрова",
      "Коновалова","Шестакова","Казакова","Ефимова","Денисова","Громова","Фомина","Давыдова","Мельникова",
      "Щербакова","Блинова","Колесникова"};
  private final static String[] MALE_NAME_2 = {"Авдей","Авксентий","Агафон","Акакий","Александр","Алексей",
      "Альберт","Альвиан","Анатолий","Андрей","Аникита","Антон","Антонин","Анфим","Аристарх",
      "Аркадий","Арсений","Артём","Артур","Архипп","Афанасий","Богдан","Борис","Вавила","Вадим",
      "Валентин","Валерий","Валерьян","Варлам","Варсонофий","Варфоломей","Василий","Венедикт",
      "Вениамин","Викентий","Виктор","Виссарион","Виталий","Владимир","Владислав","Владлен","Влас",
      "Всеволод","Вячеслав","Гавриил","Галактион","Геннадий","Георгий","Герасим","Герман","Германн",
      "Глеб","Гордей","Григорий","Данакт","Даниил","Демид","Демьян","Денис","Дмитрий","Добрыня",
      "Донат","Дорофей","Евгений","Евграф","Евдоким","Евсей","Евстафий","Егор","Емельян","Еремей",
      "Ермолай","Ерофей","Ефим","Ефрем","Ждан","Зиновий","Иакинф","Иван","Игнатий","Игорь","Илья",
      "Иннокентий","Ираклий","Ириней","Иуда","Иулиан","Капитон","Карп","Касьян","Ким","Кир",
      "Кирилл","Климент","Кондрат","Конон","Константин","Корнилий","Кузьма","Куприян","Лаврентий",
      "Лев","Леонид","Леонтий","Лука","Лукий","Лукьян","Магистриан","Макар","Максим","Марк","Мартын",
      "Матвей","Мелентий","Мина","Мирон","Мирослав","Митрофан","Михаил","Мстислав","Назар","Нестор",
      "Никанор","Никита","Никифор","Никодим","Николай","Никон","Олег","Онисим","Онуфрий","Павел",
      "Паисий","Панкратий","Пантелеймон","Парфений","Пафнутий","Пахомий","Пётр","Платон","Поликарп",
      "Порфирий","Потап","Пров","Прокопий","Протасий","Прохор","Разумник","Родион","Родослав",
      "Роман","Ростислав","Руслан","Савва","Савелий","Самуил","Святополк","Святослав","Севастьян",
      "Семён","Серафим","Сергей","Сила","Сильвестр","Созон","Софрон","Спиридон","Станислав","Степан",
      "Тарас","Тимофей","Тимур","Тит","Тихон","Трифон","Трофим","Урбан","Фаддей","Фёдор","Федосей",
      "Федот","Феликс","Феоктист","Филат","Филимон","Филипп","Фирс","Фока","Фома","Фотий","Фрол",
      "Харитон","Хрисанф","Христофор","Эдуард","Эраст"};
  private final static String[] MALE_NAME_3 = {"Авдеевич","Авксентиевич","Агафонович","Акакиевич","Александрович","Алексеевич",
      "Альбертович","Альвианович","Анатолиевич","Андреевич","Аникитович","Антонович","Антонинович","Анфимович","Аристархович",
      "Аркадиевич","Арсениевич","Артёмович","Артурович","Архиппович","Афанасиевич","Богданович","Борисович","Вавилович","Вадимович",
      "Валентинович","Валериевич","Валерьянович","Варламович","Варсонофиевич","Варфоломеевич","Василиевич","Венедиктович",
      "Вениаминович","Викентиевич","Викторович","Виссарионович","Виталиевич","Владимирович","Владиславович","Владленович","Власович",
      "Всеволодович","Вячеславович","Гавриилович","Галактионович","Геннадиевич","Георгиевич","Герасимович","Германович","Германнович",
      "Глебович","Гордеевич","Григориевич","Данактович","Даниилович","Демидович","Демьянович","Денисович","Дмитриевич","Добрыневич",
      "Донатович","Дорофеевич","Евгениевич","Евграфович","Евдокимович","Евсеевич","Евстафиевич","Егорович","Емельянович","Еремеевич",
      "Ермолаевич","Ерофеевич","Ефимович","Ефремович","Жданович","Зиновиевич","Иакинфович","Иванович","Игнатиевич","Игоревич","Ильич",
      "Иннокентиевич","Ираклиевич","Иринеевич","Иудович","Иулианович","Капитонович","Карпович","Касьянович","Кимович","Кирович",
      "Кириллович","Климентович","Кондратович","Кононович","Константинович","Корнилиевич","Кузьмич","Куприянович","Лаврентиевич",
      "Левович","Леонидович","Леонтиевич","Лукиевич","Лукьянович","Магистрианович","Макарович","Максимович","Маркович","Мартынович",
      "Матвеевич","Мелентиевич","Минович","Миронович","Мирославович","Митрофанович","Михаилович","Мстиславович","Назарович","Несторович",
      "Никанорович","Никитоевич","Никифорович","Никодимович","Николаевич","Никонович","Олегович","Онисимович","Онуфриевич","Павлович",
      "Паисиевич","Панкратиевич","Пантелеймонович","Парфениевич","Пафнутиевич","Пахомиевич","Пётрович","Платонович","Поликарпович",
      "Порфириевич","Потапович","Провович","Прокопиевич","Протасиевич","Прохорович","Разумникович","Родионович","Родославович",
      "Романович","Ростиславович","Русланович","Саввович","Савелиевич","Самуилович","Святополкович","Святославович","Севастьянович",
      "Семёнович","Серафимович","Сергеевич","Силович","Сильвестрович","Созонович","Софронович","Спиридонович","Станиславович","Степанович",
      "Тарасович","Тимофеевич","Тимурович","Титович","Тихонович","Трифонович","Трофимович","Урбанович","Фаддеевич","Фёдорович","Федосеевич",
      "Федотович","Феликсович","Феоктистович","Филатович","Филимонович","Филиппович","Фирсович","Фокиевич","Фомич","Фотиевич","Фролович",
      "Харитонович","Хрисанфович","Христофорович","Эдуардович","Эрастович"};
  private final static String[] FEMALE_NAME_2 = {"Агафья","Аглая","Агния","Агриппина","Акулина","Алевтина",
      "Александра","Алина","Алла","Анастасия","Ангелина","Анжела","Анжелика","Анна","Антонина",
      "Анфиса","Валентина","Валерия","Варвара","Василиса","Вера","Вероника","Виктория","Галина",
      "Глафира","Гликерия","Дана","Дарья","Евгения","Евдокия","Евлалия","Евлампия","Евпраксия",
      "Евфросиния","Екатерина","Елена","Елизавета","Епистима","Ермиония","Жанна","Зинаида","Злата",
      "Зоя","Инга","Инесса","Инна","Иоанна","Ираида","Ирина","Ия","Капитолина","Карина","Каролина",
      "Кира","Клавдия","Ксения","Лада","Лариса","Лидия","Лилия","Любовь","Людмила","Маргарита",
      "Марина","Мария","Марфа","Матрёна","Милица","Мирослава","Надежда","Наталья","Нина","Нонна",
      "Оксана","Октябрина","Олимпиада","Ольга","Павлина","Пелагея","Пинна","Полина","Прасковья",
      "Рада","Раиса","Римма","Светлана","Серафима","Снежана","София","Таисия","Тамара","Татьяна",
      "Улита","Ульяна","Урсула","Фаина","Феврония","Фёкла","Феодора","Целестина","Юлия","Яна (имя)","Ярослава"};
  private final static String[] FEMALE_NAME_3 = {"Авдеевна","Авксентиевна","Агафоновна","Акакиевна","Александровна","Алексеевна",
      "Альбертовна","Альвиановна","Анатолиевна","Андреевна","Аникитовна","Антоновна","Антониновна","Анфимовна","Аристарховна",
      "Аркадиевна","Арсениевна","Артёмовна","Артуровна","Архипповна","Афанасиевна","Богдановна","Борисовна","Вавиловна","Вадимовна",
      "Валентиновна","Валериевна","Валерьяновна","Варламовна","Варсонофиевна","Варфоломеевна","Василиевна","Венедиктовна",
      "Вениаминовна","Викентиевна","Викторовна","Виссарионовна","Виталиевна","Владимировна","Владиславовна","Владленовна","Власовна",
      "Всеволодовна","Вячеславовна","Гаврииловна","Галактионовна","Геннадиевна","Георгиевна","Герасимовна","Германовна","Германновна",
      "Глебовна","Гордеевна","Григориевна","Данактовна","Данииловна", "Демьяновна","Денисовна","Дмитриевна","Добрыневна",
      "Донатовна","Дорофеевна","Евгениевна","Евграфовна","Евдокимовна","Евсеевна","Евстафиевна","Егоровна","Емельяновна","Еремеевна",
      "Ермолаевна","Ерофеевна","Ефимовна","Ефремовна","Ждановна","Зиновиевна","Иакинфовна","Ивановна","Игнатовна","Игоревна","Ильинична",
      "Иннокентиевна","Ираклиевна","Иринеевна","Иудовна","Иулиановна","Капитоновна","Карповна","Касьяновна","Кимовна","Кировна",
      "Кирилловна","Климентовна","Кондратовна","Кононовна","Константиновна","Корнилиевна","Кузьминична","Куприяновна","Лаврентиевна",
      "Львовна","Леонидовна","Леонтиевна","Лукьяновна","Магистриан","Макаровна","Максимовна","Марковна","Мартыновна",
      "Матвеевна","Мелентиевна","Миновна","Мироновна","Мирославовна","Митрофановна","Михаиловна","Мстиславовна","Назаровна","Несторовна",
      "Никаноровна","Никита","Никифоровна","Никодимовна","Николаевна","Никоновна","Олеговна","Онисимовна","Онуфриевна","Павловна",
      "Паисиевна","Панкратиевна","Пантелеймоновна","Парфениевна","Пафнутиевна","Пахомиевна","Пётровна","Платоновна","Поликарповна",
      "Порфириевна","Потаповна","Прововна","Прокопиевна","Протасовна","Прохоровна","Разумниковна","Родионовна","Родославовна",
      "Романовна","Ростиславовна","Руслановна","Саввовна","Савелиевна","Самуиловна","Святополковна","Святославовна","Севастьяновна",
      "Семёновна","Серафимовна","Сергеевна","Силовна","Сильвестровна","Созоновна","Софроновна","Спиридоновна","Станиславовна","Степановна",
      "Тарасовна","Тимофеевна","Тимуровна","Титовна","Тихоновна","Трифоновна","Трофимовна","Урбановна","Фаддеевна","Фёдоровна","Федосеевна",
      "Федотовна","Феликсовна","Феоктистовна","Филатовна","Филимоновна","Филипповна","Фирсовна","Фоковна","Фомовна","Фотиевна","Фроловна",
      "Харитоновна","Хрисанфовна","Христофоровна","Эдуардовна","Эрастовна"};

  public static String getFullName(){
   double rand = 100 * Math.random();//вероятность женское/мужское ФИО - 50 на 50
   if (rand < 50) {return getMaleName();}
   else {return  getFemaleName();}
 }

 //создание мужского ФИО
 private static String getMaleName(){
   return MALE_NAME_1[(int) (MALE_NAME_1.length * Math.random())] + " " +
       MALE_NAME_2[(int) (MALE_NAME_2.length * Math.random())] + " " +
       MALE_NAME_3[(int) (MALE_NAME_3.length * Math.random())] + " ";
 }

  //создание женского ФИО
  private static String getFemaleName(){
    return FEMALE_NAME_1[(int) (FEMALE_NAME_1.length * Math.random())] + " " +
        FEMALE_NAME_2[(int) (FEMALE_NAME_2.length * Math.random())] + " " +
        FEMALE_NAME_3[(int) (FEMALE_NAME_3.length * Math.random())] + " ";
  }

}
